       01 TODO-ACTION PIC X(11).
          88 ACTION-ADD VALUE "add".
          88 ACTION-SHOW VALUE "show".
          88 ACTION-DELETE VALUE "delete".
          88 ACTION-DELETE-ITEM VALUE "delete-item".
          88 ACTION-EDIT-ITEM VALUE "edit".
