       01 TODO-ACTION PIC X(11).
          88 ACTION-ADD VALUE "add".
          88 ACTION-SHOW VALUE "show".
          88 ACTION-DELETE VALUE "delete".
          88 ACTION-DELETE-ITEM VALUE "delete-item".
<<<<<<< HEAD
          88 ACTION-EDIT-ITEM VALUE "edit".
=======
          88 ACTION-EDIT-ITEM VALUE "edit".

>>>>>>> 9c6ff18a0ff1f256441e51c0bb5ca687a9e2420b
